xpress-embedo/STM32F4/03-ILI9341/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */
#define COVER(x)                do {      \
                                      x;  \
                                } while(0)

#define TRUE                    (0x01)
#define FALSE                   (0x00)
/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define USER_BUTTON_Pin GPIO_PIN_13
#define USER_BUTTON_GPIO_Port GPIOC
#define RED_SLIDER_Pin GPIO_PIN_0
#define RED_SLIDER_GPIO_Port GPIOA
#define GREEN_SLIDER_Pin GPIO_PIN_1
#define GREEN_SLIDER_GPIO_Port GPIOA
#define LED_GREEN_Pin GPIO_PIN_4
#define LED_GREEN_GPIO_Port GPIOA
#define LED_RED_Pin GPIO_PIN_5
#define LED_RED_GPIO_Port GPIOA
#define USER_LED_Pin GPIO_PIN_6
#define USER_LED_GPIO_Port GPIOA
#define BLUE_SLIDER_Pin GPIO_PIN_7
#define BLUE_SLIDER_GPIO_Port GPIOA
#define TEMP_SENS_Pin GPIO_PIN_0
#define TEMP_SENS_GPIO_Port GPIOB
#define DC_Pin GPIO_PIN_9
#define DC_GPIO_Port GPIOD
#define CS_Pin GPIO_PIN_11
#define CS_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */
void HAL_SPI_ChangeDataSizeTo16Bit( SPI_HandleTypeDef *hspi );
void HAL_SPI_ChangeDataSizeTo8Bit( SPI_HandleTypeDef *hspi );
uint8_t Display_GetSliderCounts( uint8_t slider_type );
uint8_t * Display_GetTempData( void );

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
